{
    "current-openings": [
        {
            "spotlight": true,
            "title": "Senior Construction Inspector",
            "number": 1,
            "categories": true,
            "image": true,
            "qualifications": "Graduation from high school or equivalent and four years civil engineering, road design, survey, or road construction inspection experience; or any equivalent combination of related training and experience.",
            "summary": "This is advanced technical work in road construction inspection, design, and contract administration in the Alachua County Department of Public Works. An employee assigned to this classification will perform field verification of contractor's survey and layout work involving the Public Works inspection of major engineering construction projects to insure compliance with legal regulations and prescribed specifications. Work is performed under the direction of the Construction Inspections Superintendent is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Animal Investigations Officer",
            "number": 2,
            "categories": false,
            "image": false,
            "qualifications": "Graduation from high school or equivalent and two years of experience as an animal services officer. Must provide means of being contacted by phone.  A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position. As a condition of employment, incumbents must meet all Drug Enforcement Agency (DEA) requirements/prerequisites to handle controlled substances and be a certified Animal Control Officer through the Florida Animal Control Association (FACA) at time of employment.  In addition they must pass the Euthanasia Technician Certification Course through FACA and become a Florida Notary Public within six (6) months of date of hire. Successful completion of a pre-employment physical examination and criminal history background investigation are required prior to employment.",
            "summary": "This is specialized enforcement and investigative work for Alachua County Animal Services. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification investigates animal cruelty and neglect charges and performs related duties to promote compliance with Alachua County ordinances regulating animal treatment. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports and observation of the results obtained."
        },
        {
            "spotlight": false,
            "title": "Critical Facilities Manager",
            "number": 3,
            "categories": false,
            "image": false,
            "qualifications": "Bachelor's degree in business administration, facilities management, construction management, architecture or a closely related field and five years related professional level facilities management experience, including three years of supervisory experience; or any equivalent combination of related training and experience. A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7;  Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.   Requires the successful completion of a criminal history background investigation prior to employment Including finger printing and compliance with Federal Bureau of Investigation (FBI) Criminal Justice Information Services (CJIS) requirements throughout the term of employment.",
            "summary": "This is highly responsible managerial work planning, organizing, and directing the activities of the Critical Facilities Division This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work.  An employee assigned to this classification is responsible for coordinating the maintenance and repair of buildings, including grounds, overseeing the county's Critical Facilities capital improvement program. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Equipment Operator II",
            "number": 4,
            "categories": false,
            "image": false,
            "qualifications": "Completion of eighth grade and one year experience operating equipment; or any equivalent combination of training and experience. A valid State of Florida Class 'A' Commercial Driver's License with air brakes is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.  Must obtain an 'N' endorsement within thirty days of employment.  Requires successful completion of a criminal history background investigation prior to employment. Successful completion of a pre-employment physical examination is required prior to employment.",
            "summary": "This is skilled work operating a variety of power construction equipment and motorized vehicles for the Alachua County Department of Public Works. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification is responsible for the safe and efficient operation of various types of moderately complex/heavy equipment, conducting routine/preventative maintenance and performing manual tasks. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Equipment Operator III",
            "number": 5,
            "categories": false,
            "image": false,
            "qualifications": "Completion of eighth grade and two years experience operating heavy and/or complex equipment; or any equivalent combination of related training and experience. A valid State of Florida Class 'A' Commercial Driver's License with air brakes is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.  Must obtain an 'N' endorsement within thirty days of employment.  Requires successful completion of a criminal history background investigation prior to employment.   Successful completion of a pre-employment physical examination is required prior to employment.",
            "summary": "This is highly skilled work operating a variety of power construction equipment and motorized vehicles for the Alachua County Department of Public Works. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification operates compressors, pumps, hoists, cranes, derricks, shovels, tractors, scrapers, and motor graders to excavate, move, and grade earth, erect structural and reinforcing steel, and pour concrete or other hard surface paving materials. Work is performed under the direction of a higher level  supervisor and is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Firefighter",
            "number": 6,
            "categories": false,
            "image": false,
            "qualifications": "Graduation from high school or equivalent. Successful completion of a pre-employment physical examination and criminal history background check is required prior to employment. UPON SUBMISSION OF APPLICATION, PROOF OF THE FOLLOWING MUST BE ATTACHED TO YOUR APPLICATION, OR PROVIDED VIA  MAIL, OR FAX TO  HUMAN RESOURCES @ 352-374-5233: 1. A sworn affidavit attesting to the non-use of tobacco products. Click this link (Download PDF reader) to retrieve the document 2. Current enrollment in a state recognized Fire Academy (if non-certified at time of application). Candidate must receive State of Florida Certificate of Compliance prior to official job offer. 3. A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment. If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position 4. Candidates must possess a valid Candidate Physical Ability Test (CPAT) Certificate provided by an authorized CPAT testing center prior to interview date. Valid CPAT certificates must be dated within 1 year of application date. 5. Alachua County will pay for Emergency Medical Technician (EMT) training and certification, EMT certification must be obtained within one year of employment in the FF classification.  Applicants will be required to make a two year commitment as a full time certified EMT with Alachua County Fire Rescue.",
            "summary": "This is responsible technical work in the Fire Rescue Services Department protecting life and property by performing firefighting, driving apparatus, performing emergency medical aid, hazardous materials and fire prevention duties. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification is responsible for safely transporting a crew and medical equipment to the patient, assisting in providing immediate care to the critically ill or injured on an emergency basis, transporting the patient to a medical facility, and performing firefighter duties including combating, extinguishing and preventing fires as required. Work is performed within standard operating procedure guidelines and an employee is expected to exercise independent judgment, based upon firefighting and emergency medical training. Work is performed under a higher level supervisor and is reviewed through observation of results obtained."
        }
    ]
}