{
    "current-openings": [
        {
            "spotlight": true,
            "title": "Senior Construction Inspector",
            "number": 1,
            "categories": true,
            "image": true,
            "qualifications": "Graduation from high school or equivalent and four years civil engineering, road design, survey, or road construction inspection experience; or any equivalent combination of related training and experience.",
            "summary": "This is advanced technical work in road construction inspection, design, and contract administration in the Alachua County Department of Public Works. An employee assigned to this classification will perform field verification of contractor's survey and layout work involving the Public Works inspection of major engineering construction projects to insure compliance with legal regulations and prescribed specifications. Work is performed under the direction of the Construction Inspections Superintendent is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Animal Investigations Officer",
            "number": 2,
            "categories": false,
            "image": false,
            "qualifications": "Graduation from high school or equivalent and two years of experience as an animal services officer. Must provide means of being contacted by phone.  A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position. As a condition of employment, incumbents must meet all Drug Enforcement Agency (DEA) requirements/prerequisites to handle controlled substances and be a certified Animal Control Officer through the Florida Animal Control Association (FACA) at time of employment.  In addition they must pass the Euthanasia Technician Certification Course through FACA and become a Florida Notary Public within six (6) months of date of hire. Successful completion of a pre-employment physical examination and criminal history background investigation are required prior to employment.",
            "summary": "This is specialized enforcement and investigative work for Alachua County Animal Services. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification investigates animal cruelty and neglect charges and performs related duties to promote compliance with Alachua County ordinances regulating animal treatment. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports and observation of the results obtained."
        },
        {
            "spotlight": false,
            "title": "Critical Facilities Manager",
            "number": 3,
            "categories": false,
            "image": false,
            "qualifications": "Bachelor's degree in business administration, facilities management, construction management, architecture or a closely related field and five years related professional level facilities management experience, including three years of supervisory experience; or any equivalent combination of related training and experience. A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7;  Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.   Requires the successful completion of a criminal history background investigation prior to employment Including finger printing and compliance with Federal Bureau of Investigation (FBI) Criminal Justice Information Services (CJIS) requirements throughout the term of employment.",
            "summary": "This is highly responsible managerial work planning, organizing, and directing the activities of the Critical Facilities Division This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work.  An employee assigned to this classification is responsible for coordinating the maintenance and repair of buildings, including grounds, overseeing the county's Critical Facilities capital improvement program. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Equipment Operator II",
            "number": 4,
            "categories": false,
            "image": false,
            "qualifications": "Completion of eighth grade and one year experience operating equipment; or any equivalent combination of training and experience. A valid State of Florida Class 'A' Commercial Driver's License with air brakes is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.  Must obtain an 'N' endorsement within thirty days of employment.  Requires successful completion of a criminal history background investigation prior to employment. Successful completion of a pre-employment physical examination is required prior to employment.",
            "summary": "This is skilled work operating a variety of power construction equipment and motorized vehicles for the Alachua County Department of Public Works. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification is responsible for the safe and efficient operation of various types of moderately complex/heavy equipment, conducting routine/preventative maintenance and performing manual tasks. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Equipment Operator III",
            "number": 5,
            "categories": false,
            "image": false,
            "qualifications": "Completion of eighth grade and two years experience operating heavy and/or complex equipment; or any equivalent combination of related training and experience. A valid State of Florida Class 'A' Commercial Driver's License with air brakes is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.  Must obtain an 'N' endorsement within thirty days of employment.  Requires successful completion of a criminal history background investigation prior to employment.   Successful completion of a pre-employment physical examination is required prior to employment.",
            "summary": "This is highly skilled work operating a variety of power construction equipment and motorized vehicles for the Alachua County Department of Public Works. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification operates compressors, pumps, hoists, cranes, derricks, shovels, tractors, scrapers, and motor graders to excavate, move, and grade earth, erect structural and reinforcing steel, and pour concrete or other hard surface paving materials. Work is performed under the direction of a higher level  supervisor and is reviewed through conferences, reports, and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Firefighter",
            "number": 6,
            "categories": false,
            "image": false,
            "qualifications": "Graduation from high school or equivalent. Successful completion of a pre-employment physical examination and criminal history background check is required prior to employment. UPON SUBMISSION OF APPLICATION, PROOF OF THE FOLLOWING MUST BE ATTACHED TO YOUR APPLICATION, OR PROVIDED VIA  MAIL, OR FAX TO  HUMAN RESOURCES @ 352-374-5233: 1. A sworn affidavit attesting to the non-use of tobacco products. Click this link (Download PDF reader) to retrieve the document 2. Current enrollment in a state recognized Fire Academy (if non-certified at time of application). Candidate must receive State of Florida Certificate of Compliance prior to official job offer. 3. A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment. If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position 4. Candidates must possess a valid Candidate Physical Ability Test (CPAT) Certificate provided by an authorized CPAT testing center prior to interview date. Valid CPAT certificates must be dated within 1 year of application date. 5. Alachua County will pay for Emergency Medical Technician (EMT) training and certification, EMT certification must be obtained within one year of employment in the FF classification.  Applicants will be required to make a two year commitment as a full time certified EMT with Alachua County Fire Rescue.",
            "summary": "This is responsible technical work in the Fire Rescue Services Department protecting life and property by performing firefighting, driving apparatus, performing emergency medical aid, hazardous materials and fire prevention duties. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification is responsible for safely transporting a crew and medical equipment to the patient, assisting in providing immediate care to the critically ill or injured on an emergency basis, transporting the patient to a medical facility, and performing firefighter duties including combating, extinguishing and preventing fires as required. Work is performed within standard operating procedure guidelines and an employee is expected to exercise independent judgment, based upon firefighting and emergency medical training. Work is performed under a higher level supervisor and is reviewed through observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "GIS/Data Analyst Manager",
            "number": 7,
            "categories": false,
            "image": false,
            "qualifications": "Bachelor's degree in planning, geography, computer science, public safety, geomatics, or related field, and  three years of GIS experience; or any equivalent combination of related training and experience. A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position. Applicants within six months of meeting the minimum education/experience requirement may be considered for trainee status.",
            "summary": "This is highly responsible supervisory, professional and technical work coordinating the E911 Geographic Information Systems (GIS) program and Fire/EMS data analysis for Alachua County Fire Rescue. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification supervises GIS staff within a section under County Fire Rescue; responsible for their professional development and work performance; responsible for the continuous analysis & maintenance of various data sources produced by the E9-1-1 Office and the County Fire Rescue Department. Work is performed under the general direction of a higher-level supervisor and is reviewed through observation, reports, meetings, and results obtained."
        },
        {
            "spotlight": false,
            "title": "Growth Management Director",
            "number": 8,
            "categories": false,
            "image": false,
            "qualifications": "Master's degree in urban and regional planning and five years progressively responsible, administrative and supervisory experience in the delivery of growth management programs; or any equivalent combination of related training and experience. Successful completion of a criminal history background investigation is required prior to employment.  An incumbent of this job classification will be required to file a financial disclosure statement (Form 1) with the Supervisor of Elections in their county of residence, in compliance with Florida Statutes, Chapter 112, Part III. Such filing is required within 30 days of placement in a covered position, annually thereafter by no later than July 1 of each year in which they serve in the covered position, and within 60 days of leaving the covered position.",
            "summary": "This is highly responsible administrative and managerial work directing the activities of the Alachua County Department of Growth Management. An employee assigned to this classification is responsible for directing the programs and activities within the offices of Codes Enforcement, Planning and Development including recommending to the County Manager and BOCC program implementation, budgeting, fiscal operations, long and short range goal development, policy formulation and staff selection. Work is performed under the direction of the County Manager and is reviewed through conferences, reports and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Jail Population Manager",
            "number": 9,
            "categories": false,
            "image": false,
            "qualifications": "Bachelor's degree in Criminal Justice, Business, Public Administration or related field and three years progressively responsible related experience; or any combination of related training and experience. Master's Degree in related field or Juris Doctorate may be substituted for two years experience. A valid Florida Driver License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.  Must satisfactorily complete local, state and national criminal history and fingerprint checks. Must successfully obtain FDLE Criminal justice Information System (CJIS) certification within one month of employment or assignment which requires access to the Florida Crime Information Center (FCIC)/National Crime Information Center (NCIC).  Certification must be maintained as a condition of employment; re-certification required every two years.  This is a Level One certification.  Applicants within six months of meeting the education/experience requirement may be considered for trainee status.",
            "summary": "This is responsible administrative work developing, implementing and coordinating  jail population management strategies, systems, and processes. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification is responsible for researching jail population management strategies and programs; determining best practice methodology and implementing effective and efficient program policies. This employee will develop, implement and coordinate processes to triage in custody inmates and coordinate with the centralized screening team, jail classification and medical staff to identify the most expeditious and safe means of release. Work is performed under direction of a higher level supervisor and is reviewed through reports, conferences and observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Laborer II",
            "number": 10,
            "categories": false,
            "image": false,
            "qualifications": "Completion of the eighth grade and six months manual labor experience with a familiarity with the area of assignment; or any equivalent combination of related training and experience. A valid State of Florida Driver's License is required and a Motor Vehicle Record that meets the requirements of Alachua County policy # 6-7; Motor Vehicle Records will be reviewed prior to employment.  If in the past 24-month period, the record shows more than 3 moving traffic violations, and/or a conviction/pending charge for driving under the influence, the minimum qualifications are not met for the position.  Requires successful completion of a criminal history background investigation prior to employment. Successful completion of a pre-employment physical examination is required prior to employment.",
            "summary": "This is limited skilled manual work requiring the application of techniques and knowledge above the basic laboring level. Acts as work leader in absence of a supervisor, operates equipment requiring a degree of learned skills and performs light carpentry work. This is an emergency essential classification. Upon declaration of a disaster and/or emergency, all employees in this classification are required to work. An employee assigned to this classification performs advanced laboring tasks including the operation of light mowers, farm and industrial equipment or the use of specialized machines and hand tools. This work may be performed under close supervision or general supervision in accordance with specific instructions and with defined procedures and schedules. Work is reviewed while in progress and upon completion for adherence to instructions and conformance with established standards."
        },
        {
            "spotlight": false,
            "title": "On-Call Critical Care Paramedic 40",
            "number": 11,
            "categories": false,
            "image": false,
            "qualifications": "Graduation from high school or equivalent. Successful completion of a pre-employment physical examination is required prior to employment. Upon submission of application, proof of the following must be provided: 1. Current State of Florida Paramedic certificate with Critical Care attending privileges as approved by the Alachua  County Medical  Director. 2.  Current designation as an Advanced Cardiac Life Support Provider. 3. A valid State of Florida driver's license; free from moving violation citations for a period of not less than six months preceding employment; and within the past three years, applicant must have had no convictions for reckless driving, or driving under the influence of alcohol or controlled substances, and must not have had a driver's license suspended pursuant to Florida law. Successful applicants must meet all requirements for Drivers as listed in Florida Statutes 401.281.Upon appointment to position, the following must be completed and maintained as a condition of employment: 1. Successful completion of a course in Pre-Hospital Trauma Life Support /  International Trauma Life Support  must be obtained within the first twelve months upon appointment to position. 2. Certification by the Alachua County Medical Director within the first month of employment and maintain this certification as a condition of employment.",
            "summary": "This is responsible technical work in the Department of Public Safety providing medical care to the critically ill or injured on an emergency and/or non-emergency basis. An employee assigned to this classification is the lead worker on an ALS Critical Care ambulance who is responsible for rendering initial evaluations of patients and performing advanced life support and/or Critical Care procedures on the sick or injured. Work is performed within standard guidelines and  under physician's orders via telephone or radio. An employee is expected to exercise considerable independent judgment, based  on technical training in the emergency medical field. Work is reviewed by a higher level supervisor through quality assurance, reports and  observation of results obtained."
        },
        {
            "spotlight": false,
            "title": "Maintenance Supervisor I",
            "number": 12,
            "categories": false,
            "image": false,
            "qualifications": "Department of Public Works;Road and Bridge Division: Graduation from high school or equivalent and one year experience in supervision of inmates or inmate work crews, roads maintenance and/or repair; or any equivalent combination of related training and experience. Successful completion of a pre-employment physical examination and criminal history background check are required prior to employment. Must currently possess and maintain a valid State of Florida Class 'B' Commercial Driver's license. Must successfully complete the Inmate Supervisor Training Non-DOC course within 12 months of employment; upon completion of the Inmate Supervisory Training Non-DOC  course, the Inmate Supervisor Non-DOC authorization card must be maintained as a condition of employment.",
            "summary": "This is responsible work supervising and coordinating the activities of a County employees, as well as inmate work crews, engaged in maintaining and repairing roadways, bridges, parks, and open spaces for the Alachua County Department of Public Works and Department of Parks and Recreation. An employee assigned to this classification functions as a crew leader for a small work crew performing a variety of routine maintenance and repair tasks related to road and construction and maintenance work and participating in the performance of those tasks while supervising the employee work crew.  An employee assigned to this classification responsible for the inmate work crew will coordinate, direct and oversee the work of the crew but will not participate in the maintenance work. Work is performed under the direction of a higher level supervisor and is reviewed through conferences, reports, and observation of results obtained."
        }
    ]
}